import type { NextPage } from 'next'
import { Container, Typography } from '@mui/material'
import { MainLayout } from '../modules'
import { SocSetBlock } from '../Components'

const About: NextPage = () => {
  const socials = {
    facebook: 'facebook',
    instagram: 'instagram',
    twitter: 'twitter',
    youtube: 'youtube',
    telegram: 'telegram',
  }

  return (
    <MainLayout>
      <Container maxWidth="md" sx={{ marginBottom: 6 }}>
        <Typography variant="h4" marginTop={13} marginBottom={2}>
          Хто ми такі?
        </Typography>
        <Typography variant="body1">
          Творці проекту - самі що не є звичайні люди. Ми ті, кого можна
          зустріти поруч у метро, ті хто п&apos;ють каву за сусіднім столиком,
          кидають фрісбі в парку... і у нас ті ж проблеми, і головна з них -
          катастрофічний брак вільного часу. Тому намагаємося ті лічені миті
          вільного часу провести цікаво, з користю і морем емоцій. Ось і
          вирішили поділитися нашим досвідом, написати про побачене, описати
          пережите.
        </Typography>
        <Typography variant="h5" marginTop={3} marginBottom={2}>
          Для кого наш проект?
        </Typography>
        <Typography variant="body1">
          Для людей бажаючих відкрити нові розваги, місця або просто бажаючих
          організувати собі незвичайний день. Ми розуміємо, що експериментувати
          складно, а ціни завжди проти нас. Тому намагаємося максимально все
          випробувати на собі, щоб наші рекомендації підійшли саме вам.
        </Typography>
        <Typography variant="h5" marginTop={3} marginBottom={2}>
          Діліться своїм досвідом організації дозвілля!
        </Typography>
        <Typography variant="body1">
          Ми завжди раді почути про нові місцях. Впевнені, всі оцінять ваш
          досвід і поради. Добавляйте нові цікаві місця на карту, розповідайте
          про свої подорожі і діліться цікавими маршрутами.
        </Typography>
        <Typography variant="h5" marginTop={3} marginBottom={2}>
          Наша місія.
        </Typography>
        <Typography variant="body1">
          Ми мріємо, щоб самостійно подорожувати Україною було так само зручно й
          безтурботно, як відпочивати на курортах Єгипту й Туреччини. Аби
          активний відпочинок і подорожі Україною стали такими ж популярними, як
          щорічна відпустка на морі. І такими ж престижними, як поїздки до
          Європи, Америки чи Азії. Ми хочемо, щоб більше не було українців, які
          уже встигли побувати в багатьох країнах світу, але досі ще не бачили
          того, що є у себе вдома. Які ще не вдихали аромат кави на вуличках
          романтичного Львова і запах квітучої сакури у весняному Ужгороді. Які
          ще не завмирали від подиху століть у Софії Київській та Херсонесі
          Таврійському. Які ще не захоплювались історичною величчю мурів
          Кам&apos;янець-Подільської, Хотинської та Аккерманської фортець. У
          яких ще не паморочилось в голові від кришталево-чистого повітря і
          неймовірних краєвидів Українських Карпат.
          <br />
          <br />
          Ми також прагнемо, щоб іноземці знали і бачили Україну не лише завдяки
          Чорнобильській трагедії і подіям Євромайдану.
          <br />
          <br />
          Щоб «і наші, і ваші» спочатку повірили, а потім переконались: Україна
          не гірша, а багато в чому і краща для туристів, ніж будь-яка країна
          Європи чи світу.
        </Typography>
        <Typography variant="h6" marginTop={3} marginBottom={2}>
          Контакти:
        </Typography>
        <Typography variant="body1">roma-lysyk@ukr.net</Typography>
        <Typography variant="h6" marginTop={3}>
          Ми в соціальних мережах:
        </Typography>
        <SocSetBlock socials={socials} color="fullcolor" />
      </Container>
    </MainLayout>
  )
}

export default About
