export const regions = [
  {
    label: 'Автономна республіка Крим',
    center: { lat: 45.257, lng: 34.5183 },
  },
  {
    label: 'Вінницька область',
    center: { lat: 48.9983, lng: 28.6304 },
  },
  {
    label: 'Волинська область',
    center: { lat: 51.1382, lng: 24.8448 },
  },
  {
    label: 'Дніпропетровська область',
    center: { lat: 48.3268, lng: 34.9419 },
  },
  {
    label: 'Донецька область',
    center: { lat: 48.0825, lng: 37.6769 },
  },
  {
    label: 'Житомирська область',
    center: { lat: 50.6278, lng: 28.4666 },
  },
  {
    label: 'Закарпатська область',
    center: { lat: 48.4993, lng: 23.3809 },
  },
  {
    label: 'Запорізька область',
    center: { lat: 47.256, lng: 35.6827 },
  },
  {
    label: 'Івано-Франківська область',
    center: { lat: 48.655, lng: 24.5581 },
  },
  {
    label: 'Київська область',
    center: { lat: 50.3565, lng: 30.6245 },
  },
  {
    label: 'місто Київ',
    center: { lat: 50.3989, lng: 30.5403 },
  },
  {
    label: 'Кіровоградська область',
    center: { lat: 48.4436, lng: 31.8224 },
  },
  {
    label: 'Луганська область',
    center: { lat: 48.9647, lng: 38.9052 },
  },
  {
    label: 'Львівська область',
    center: { lat: 49.6961, lng: 24.0222 },
  },
  {
    label: 'Миколаївська область',
    center: { lat: 47.4386, lng: 31.7106 },
  },
  {
    label: 'Одеська область',
    center: { lat: 46.7594, lng: 29.6129 },
  },
  {
    label: 'Полтавська область',
    center: { lat: 49.6225, lng: 33.8142 },
  },
  {
    label: 'Рівненська область',
    center: { lat: 50.9879, lng: 26.3809 },
  },
  {
    label: 'Сумська область',
    center: { lat: 51.2347, lng: 34.0753 },
  },
  {
    label: 'Тернопільська область',
    center: { lat: 49.3828, lng: 25.5032 },
  },
  {
    label: 'Харківська область',
    center: { lat: 49.5038, lng: 36.4691 },
  },
  {
    label: 'Херсонська область',
    center: { lat: 46.7731, lng: 33.4159 },
  },
  {
    label: 'Хмельницька область',
    center: { lat: 49.5318, lng: 26.9866 },
  },
  {
    label: 'Черкаська область',
    center: { lat: 49.3376, lng: 31.266 },
  },
  {
    label: 'Чернівецька область',
    center: { lat: 48.285, lng: 26.2011 },
  },
  {
    label: 'Чернігівська область',
    center: { lat: 51.351, lng: 31.9881 },
  },
]
